In [1]:
class animal:
    def __init__(self):
        self.name = ''
    def talk(self):
        pass
    

class dog(animal):
    def __init__(self):
        self.name = 'dog'
    def talk(self):
        print('woof')

class cat(animal):
    def __init__(self):
        self.name = 'dog'
    def talk(self):
        print('meow')
        
class bird(animal):
    def __init__(self):
        self.name = 'bird'
    def talk(self):
        print('tweet')


animals = [dog(), cat(), bird()]
for animal in animals:
    print(animal.name)
    animal.talk()
    print()

dog
woof

dog
meow

bird
tweet

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

ModuleNotFoundError: No module named 'matplotlib'

In [3]:
data = pd.Series([1, 3, 5, 7, 9])
data

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [4]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Joe'],
    'Age': [19, 34, 42, 23, 37],
    'City': ['New York', 'Paris', 'New York', 'London', 'Paris']
}
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   19  New York
1   Anna   34     Paris
2  Peter   42  New York
3  Linda   23    London
4    Joe   37     Paris

In [5]:
plt.bar(data['City'], data['Age'])

NameError: name 'plt' is not defined

In [6]:
df = pd.read_csv('Titanic.csv')
df.head()

FileNotFoundError: [Errno 2] No such file or directory: 'Titanic.csv'

In [11]:
ages = df['Age']
ages.head()

0    19
1    34
2    42
3    23
4    37
Name: Age, dtype: int64

In [12]:
df['Age'].head()

0    19
1    34
2    42
3    23
4    37
Name: Age, dtype: int64

In [13]:
df[df.Age > 50].Age

Series([], Name: Age, dtype: int64)

In [14]:
import seaborn as sns
sns.barplot(data=df, x='Sex', y='Age', hue='Pclass')

ModuleNotFoundError: No module named 'seaborn'

In [15]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Joe'],
    'Age': [19, 34, 42, 23, 37],
    'City': ['New York', 'Paris', 'New York', 'London', 'Paris']
}
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   19  New York
1   Anna   34     Paris
2  Peter   42  New York
3  Linda   23    London
4    Joe   37     Paris

In [16]:
df.groupby('City')['Age'].mean()

City
London      23.0
New York    30.5
Paris       35.5
Name: Age, dtype: float64

In [17]:
df.Age.mean()

np.float64(31.0)

In [18]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Joe'],
    'Age': [19, 34, 42, 23, 37],
    'City': ['New York', 'Paris', 'New York', 'London', 'Paris']
}
df1 = pd.DataFrame(data)


city_data = {
    'City': ['New York', 'Paris', 'London'],
    'Country': ['US', 'France', 'UK'],
    'Population': [300, 50, 30]
}

df2 = pd.DataFrame(city_data)

In [19]:
df1.head()

    Name  Age      City
0   John   19  New York
1   Anna   34     Paris
2  Peter   42  New York
3  Linda   23    London
4    Joe   37     Paris

In [20]:
df2.head()

       City Country  Population
0  New York      US         300
1     Paris  France          50
2    London      UK          30

In [21]:
pd.merge(df1, df2, on='City', how='left')

    Name  Age      City Country  Population
0   John   19  New York      US         300
1   Anna   34     Paris  France          50
2  Peter   42  New York      US         300
3  Linda   23    London      UK          30
4    Joe   37     Paris  France          50

In [22]:
import pandas as pd

data = {
    'Book Title': ['The Great Gatsby', 'To Kill a Mockingbird', '1984', 'Pride and Prejudice', 'The Catcher in the Rye'],
    'Author': ['F. Scott Fitzgerald', 'Harper Lee', 'George Orwell', 'Jane Austen', 'J.D. Salinger'],
    'Genre': ['Classic', 'Classic', 'Dystopian', 'Classic', 'Classic'],
    'Price': [10.99, 8.99, 7.99, 11.99, 9.99],
    'Copies Sold': [500, 600, 800, 300, 450]
}

df = pd.DataFrame(data)

In [149]:
df.head()

               Book Title               Author      Genre  Price  Copies Sold
0        The Great Gatsby  F. Scott Fitzgerald    Classic  10.99          500
1   To Kill a Mockingbird           Harper Lee    Classic   8.99          600
2                    1984        George Orwell  Dystopian   7.99          800
3     Pride and Prejudice          Jane Austen    Classic  11.99          300
4  The Catcher in the Rye        J.D. Salinger    Classic   9.99          450

In [150]:
df.describe()

           Price  Copies Sold
count   5.000000     5.000000
mean    9.990000   530.000000
std     1.581139   185.741756
min     7.990000   300.000000
25%     8.990000   450.000000
50%     9.990000   500.000000
75%    10.990000   600.000000
max    11.990000   800.000000

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Book Title   5 non-null      object
 1   Author       5 non-null      object
 2   Genre        5 non-null      object
 3   Price        5 non-null      float64
 4   Copies Sold  5 non-null      int64
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [152]:
df.isna().sum()

Book Title     0
Author         0
Genre          0
Price          0
Copies Sold    0
dtype: int64

In [153]:
df.sort_values(by='Price')

               Book Title               Author      Genre  Price  Copies Sold
2                    1984        George Orwell  Dystopian   7.99          800
1   To Kill a Mockingbird           Harper Lee    Classic   8.99          600
4  The Catcher in the Rye        J.D. Salinger    Classic   9.99          450
0        The Great Gatsby  F. Scott Fitzgerald    Classic  10.99          500
3     Pride and Prejudice          Jane Austen    Classic  11.99          300

In [156]:
df[df.Genre=='Classic']

               Book Title               Author    Genre  Price  Copies Sold
0        The Great Gatsby  F. Scott Fitzgerald  Classic  10.99          500
1   To Kill a Mockingbird           Harper Lee  Classic   8.99          600
3     Pride and Prejudice          Jane Austen  Classic  11.99          300
4  The Catcher in the Rye        J.D. Salinger  Classic   9.99          450

In [164]:
df.groupby(by='Author')['Copies Sold'].sum()

Author
F. Scott Fitzgerald    500
George Orwell          800
Harper Lee             600
J.D. Salinger          450
Jane Austen            300
Name: Copies Sold, dtype: int64